Tekla Open API Reference for Tekla Structures 2025
DrawingObjectSelector Methods
The DrawingObjectSelector type exposes the following members.
Methods
Name | Description
GetSelected
 Gets the selected objects in the drawing.
SelectObject
 Selects a single object in the drawing.
SelectObjects
 Selects the specified drawing objects in the drawing.
UnselectAllObjects
 Unselects all the selected objects.
UnselectObject
 Unselects a drawing object.
UnselectObjects
 Unselects the specified drawing objects keeping the other objects still selected.
Top
See Also
Reference
DrawingObjectSelector Class
Tekla.Structures.Drawing.UI Namespace